{
  "name": ["Donald John Trump,", "married:"], "info":"AGE:71<br /><br />Some fun facts about the 45th president of the Unites States: <br /> 1) Due to \"behavior problems\", Trump left school at age 13 and was enrolled in the New York Military Academy (NYMA), where he finished eighth grade and high school. <br /> 2) He has reportedly said that he \" loves \" nepotism. <br /> 3) He began the birther movement. <br /> 4) Word around the street is that \"he\" attacked Nancy Kerrigan, but this has never been proven.<br /> 5) He was on TV shows The Apprentice and WrestleMania. <br /> 6) He supports both Jeff Sessions and Roy Moore. <br /> Quote: \"Who could have known the collapse of the American middle class would be so funny?\" Anonymous ","link":"//www.factretriever.com/donald-trump-facts",
  "children": [
    {
      "name": ["Ivana Trump", "and they had:"], "info":"AGE:68<br /><br />Ivana is a Czech-American businesswoman, fashion model, author and television personality. <br />She is the first, and only age-appropriate, wife of Donald John Trump, the 45th President of the United States of America. <br /> In a now-famous interview with ABC news about her relationship with \"the Donald\" and the rest of the family, <br />Ivana has reportedly said she has a direct phone line to the White House, that she is the \"true first lady\"(contrary to what the media wants the rest of us to think), and she fully believes both her daughter,Ivanka, and her husband, Jared, could become very competent US presidents in the future. <br /> To read the rest of the interview, click here:","link":"//abcnews.go.com/US/ivana-trump-opens-surprising-facts-life-donald-trump/story?id=50330454",
      "children": [
        {
          "name": ["Donald Trump Jr.,", "who married:"], "info":"AGE:39<br /><br />Not to be confused with his identically-looking brothers, Donald Jr. is the current co-CEO of his dad's Organisation and he is married with children. He believes in small government and the many health benefits of being in nature. <br /> Unfortunately, due to the mass amnesia epidemic currently ravaging the White House senior staff, Donald Trump Jr. cannot recall anything about his life other than his children's Halloween costumes, so here's a picture of Chloe Sofia dressed as a police officer: ","link":"//www.washingtonpost.com/news/the-fix/wp/2017/11/01/donald-trump-jr-tweets-a-lesson-about-socialism-using-his-daughter-and-candy-he-may-not-grasp-socialism/?utm_term=.13e18fc6d4d8",
          "children": [
            {
              "name": ["Vanessa Trump", "and they had:"], "info":"AGE:49<br /><br /> \"Vanessa Trump was born on December 18, 1977 in New York City, New York, USA as Vanessa Kay Haydon. <br /> She is an actress, known for Something's Gotta Give (2003), The Apprentice USA (2004) and Bret Michaels: Life As I Know It (2010). <br /> She has been married to Donald Trump Jr. since November 12, 2005. They have five children.\" source and other trivia:","link":"//www.imdb.com/name/nm1615782/bio",
              "children": [
                {
                  "name": ["Kai Madison"], "info":"AGE:10<br /><br />Donald Jr.'s and Vanessa Trump's eldest child.","link":""
                },
                {
                  "name": ["Donald III"], "info":"AGE:8<br /><br />Donald Jr.'s and Vanessa Trump's second child.","link":""
                },
                {
                  "name": ["Chloe Sophia"], "info":"AGE:3<br /><br />Donald Jr.'s and Vanessa Trump's eldest child.","link":""
                },
                {
                  "name": ["Tristan Milos"], "info":"AGE:6<br /><br />Donald Jr.'s and Vanessa Trump's third child.","link":""
                },
                {
                  "name": ["Spencer Frederick"], "info":"AGE:5<br /><br />Donald Jr.'s and Vanessa Trump's forth child.","link":""
                }
              ]
            }
          ]
        },
        {
          "name": ["Ivanka Trump,", "who married:"], "info":"AGE:36<br /><br />Ivanka is a complicated woman and her accomplishments are many. Some of them are: <br /> 1) She has converted to Judaism to be with her husband, Jared. <br /> 2) She is a senior advisor to her father in the White House. <br /> 3) She was the inspiration and champion of the famous \"complicit\" hastag, therefore, making her a certified pop and culture icon. <br /> 4) The name Ivanka is a diminutive form of Ivana. <br /> 5) She, also, runs a very successful line of fashion items including clothes, handbags, shoes, and accessories, that was, unfortunately, dropped by Neiman Marcus and Nordstrom earlier in 2017. <br /> This caused much distress to her father, Donald J. Trump, who accused the stores of treating his daughter unfairly. <br /> However, loyal Trump supporters came to her defence immediately, by boycotting the stores. <br /> 6) Ivanka is a published author of a book encouraging women to work and fight for their rights, in beautiful, inspirational-quote verse <br />- something for which Republicans seem to have forgiven her, probably because they consider it a good marketing move.", "link":"https://web.archive.org/web/20170110113738/http://www.trump.com/the-next-generation/ivanka-trump/",
          "children": [
            {
              "name": ["Jared Kushner", "and they had:"], "info":"AGE:36<br /><br />Jared Kuschner is a very rich and powerful Democrat-turned-Republican, like his father-in-law. <br />Here's a video with some fun facts about Mr. Kushner!","link":"//www.youtube.com/watch?v=v-dWcmMGXRY",
              "children": [
                {
                  "name": ["Arabella Rose"], "info":"AGE:6<br /><br />She is the couple's eldest child. You can learn more about Arabella here:","link":"//www.romper.com/p/who-is-arabella-rose-kushner-shes-part-of-the-trump-family-15123"
                },
                {
                  "name": ["Joseph Frederick"], "info":"AGE:4<br /><br />He is named after his great-great grandfather, Friedrich Trump, a Bavarian barber. <br /> Since Joseph is a baby, here's some info about his great-great grandfather:","link":"//en.wikipedia.org/wiki/Frederick_Trump"
                },
                {
                  "name": ["Theodore James"], "info":"AGE:1<br /><br />Not to be confused with the British actor of the same name, Theo is Ivanka's son. <br /> Here's an unforgettable and sweet instance of Ivanka wishing her son a happy birthday!:","link":"//twitter.com/ivankatrump/status/802881830886211584?lang=en"
                }
              ]
            }
          ]
        },
        {
          "name": ["Eric Trump,", "who married:"], "info":"AGE:33<br /><br />Eric Trump is the US President's second son and current co-CEO of the Trump Organisation, <br /> a collective name of approximately 500 business entities of which Donald Trump is the sole or principal owner.<br /> Eric is a very down-to-earth, child of divorce who, according to SNL, loves juice and cheerios. <br /> Unfortunately, he's been involved in a scandal where Forbes is accusing the Eric Trump Foundation of redirecting donations destined for kids with cancer towards the family businesses and golf courses. <br /> Of course, Eric denies the allegations and claims the research hospital was made aware of this well in advance. <br /> CNBC cleared the confusion: ","link":"",
          "children": [
            {
              "name": ["Lara Yunaska", "and they had:"], "info":"AGE:35<br /><br />She is the wife of Eric Trump as well as the Host and Producer of Real News Update, a News Update that is real, instead of being fake. <br /> Here's more than you need to know about her:","link":"//www.standard.co.uk/lifestyle/london-life/meet-lara-trump-the-new-face-of-real-news-a3604381.html",
              "children": [
                {
                  "name": ["Eric \"Luke\" Trump"], "info":"AGE:3 months<br /><br />Not much is known about Eric, except that he is a baby:","link":"//twitter.com/EricTrump/media"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": ["Marla Maples", "and they had:"], "info":"AGE:54<br /><br />Since none of us are old, or American enough to know who this person is, <br /> here's what Wikipedia has to say:","link":"//en.wikipedia.org/wiki/Marla_Maples",
      "children": [
        {
          "name": ["Tiffany Trump"], "info":"AGE:24<br /><br />We hear she has a very popular Instagram account! <br /> Here's more you can learn about Tiffany:","link":"//www.vanityfair.com/news/2016/12/inside-ivanka-trump-and-tiffany-trump-complicated-sister-act"
        }
      ]
    },
    {
      "name": ["Melania Trump", "and they had:"], "info":"AGE:47<br /><br />Melania Trump is the First Lady of the United States of America, devoted mother and wife, ex super-model and Christmas enthusiast! <br /> click here for more:","link":"//www.biography.com/people/melania-trump-812016",
      "children": [
        {
          "name": ["Barron Trump"], "info":"AGE:11<br /><br />Barron Trump is the Donald's latest spawn, he was born in 2006 and he has all the potential to be just like his uncle, Jared, <br />but, for now he's simply the first son of the United States who really enjoys sports! <br /> Did you know his favourite cartoon character is Winnie the Pooh? <br /> Here's a link with more fun facts about Barron:","link":"//www.cheatsheet.com/money-career/barron-trump-facts-that-redefine-americas-first-son.html/?a=viewall"
        }
      ]
    }
  ]
}
